@echo off
chcp 1251
echo ------------------------------------------------------------------------------
echo ожидаемый результат: равносторонний
triangle.exe 1 1 1
echo ------------------------------------------------------------------------------
echo ожидаемый результат: равнобедренный
triangle.exe 2 3 3
echo ------------------------------------------------------------------------------
echo ожидаемый результат: обычный
triangle.exe 3 4 5
echo ------------------------------------------------------------------------------
echo ожидаемый результат: Некорректный ввод...
triangle.exe 3 4 a
echo ------------------------------------------------------------------------------
echo ожидаемый результат: Некорректный ввод...
triangle.exe 3 2
echo ------------------------------------------------------------------------------
echo ожидаемый результат: Некорректный ввод...
triangle.exe 3 4 -5
echo ------------------------------------------------------------------------------
echo ожидаемый результат: Некорректный ввод...
triangle.exe 3 0 5
echo ------------------------------------------------------------------------------
echo ожидаемый результат: Это не треугольник
triangle.exe 1 2 6
echo ------------------------------------------------------------------------------
echo ожидаемый результат: равносторонний
triangle.exe 1.00 1.00 1.00
echo ------------------------------------------------------------------------------
echo ожидаемый результат: равносторонний
triangle.exe 1.005 1.003 1.001
echo ------------------------------------------------------------------------------
echo ожидаемый результат: равнобедренный
triangle.exe 1.00 1.009 1.005
echo ------------------------------------------------------------------------------
pause